Revit 2026 API

# EnergyDataSettingsEnergyModel Property

---

if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off but setting this datum does not do the work, just reflects the state.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool EnergyModel { get; set; }
```
```vb
Public Property EnergyModel As Boolean
	Get
	Set
```
```cpp
public:
property bool EnergyModel {
	bool get ();
	void set (bool value);
}
```
```fsharp
member EnergyModel : bool with get, set
```

#### Property Value

Boolean true if energy model is on, false otherwise

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace